Autodesk.Revit.DB.ExternalFileUtils.GetAllExternalFileReferences(Autodesk.Revit.DB.Document)
Gets the ids of all elements which are external file references.
Remarks:
This function will not return the ids of nested Revit links;
it only returns top-level references.
aDoc:
A Revit Document.
Returns:
The ids of all elements which are external file references.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.ExternalFileUtils.GetExternalFileReference(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Gets the external file referencing data for the given element.
aDoc:
A Revit Document.
elemId:
The element whose external file reference we want.
Returns:
An object containing path and type information for the given element's external file.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element elemId does not exist in the document
-or-
elemId does not represent an external file reference.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.ExternalFileUtils.IsExternalFileReference(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Determines whether the given element represents an external file.
Remarks:
CAD imports are not external file references, as their
data is brought fully into Revit. No connection is maintained
to the original file.
A link may be an external resource without being an external file.
aDoc:
A Revit Document.
elemId:
The element to be checked for an external file reference.
Returns:
True if the given element represents an external file; false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element elemId does not exist in the document
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.ExternalFileUtils
A utility class containing functions related to external file references.
Remarks:
Elements which are external file references refer to files outside of the base .rvt file.
Examples include Revit links, CAD links, the element which stores the location
of the keynote file, and rendering decals.
Since:
2012